<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9750f89edf37bb9f1c4dabf8474056954900dc9bca2cf42f78fa1ff36572a701","plan_job_ref":"Job .github/workflows/_test-tf.yaml #193 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361137102","plan_out_hash":"1f6a7e1cfee0f9684847f33d9bb96c11b41c15e14ddb4ffa29604c9e0b1a7afb","plan_hash":"c8a223b998e790d69e667f230cc9f3479a845093348d718207770314c48c306f","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #193](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361137102)